IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/SPINLOCK0_SPINLOCK0.xml
<module name="SPINLOCK0_SPINLOCK0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="SPINLOCK0_REVISION" acronym="SPINLOCK0_REVISION" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Used to distinguish which ID numbering scheme is used." range="31 - 30" rwaccess="RO"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="BU identifier" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1786" description="Module family." range="27 - 16" rwaccess="RO"/> 
		<bitfield id="R_RTL" width="5" begin="15" end="11" resetval="0x12" description="RTL version. R of X.Y.R.Z" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="X_MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision. X of X.Y.R.Z" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Special version number" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="Y_MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor revision. Y of X.Y.R.Z" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="SPINLOCK0_SYSCONFIG" acronym="SPINLOCK0_SYSCONFIG" offset="0x10" width="8" description="">
		<bitfield id="SOFTRESET" width="1" begin="1" end="1" resetval="0x0" description="Module Software ResetThe bit is automatically reset by the hardware. During reads, it always returns 0It has the same effect as the hardware resetWriting a 0 has no effect. Writing a 1 will start a soft reset sequence and free all of the locks" range="1" rwaccess="RW"/>
	</register>
	<register id="SPINLOCK0_SYSTATUS" acronym="SPINLOCK0_SYSTATUS" offset="0x14" width="32" description="">
		<bitfield id="NUMLOCKS" width="8" begin="31" end="24" resetval="0x8" description="Module configuration parameter n, the total number of spinlocks divided by 32.e.g. For 256 spin locks, this will return the number 0x08" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="IU7" width="1" begin="7" end="7" resetval="0x0" description="In-Use flag 7 covering lock registers 224 - 255.If no lock registers are implemented in this range, then this flag always reads as 0Read 0 : All lock registers 224 - 255 are in the Not Taken stateRead 1 : At least one of the lock registers 224 - 255 are in the Taken state" range="7" rwaccess="RO"/> 
		<bitfield id="IU6" width="1" begin="6" end="6" resetval="0x0" description="In-Use flag 6 covering lock registers 192 - 223.If no lock registers are implemented in this range, then this flag always reads as 0Read 0 : All lock registers 192 - 223 are in the Not Taken stateRead 1 : At least one of the lock registers 192 - 223 are in the Taken state" range="6" rwaccess="RO"/> 
		<bitfield id="IU5" width="1" begin="5" end="5" resetval="0x0" description="In-Use flag 5 covering lock registers 160 - 191.If no lock registers are implemented in this range, then this flag always reads as 0Read 0 : All lock registers 160 - 191 are in the Not Taken stateRead 1 : At least one of the lock registers 160 - 191 are in the Taken state" range="5" rwaccess="RO"/> 
		<bitfield id="IU4" width="1" begin="4" end="4" resetval="0x0" description="In-Use flag 4 covering lock registers 128 - 159.If no lock registers are implemented in this range, then this flag always reads as 0Read 0 : All lock registers 128 - 159 are in the Not Taken stateRead 1 : At least one of the lock registers 128 - 159 are in the Taken state" range="4" rwaccess="RO"/> 
		<bitfield id="IU3" width="1" begin="3" end="3" resetval="0x0" description="In-Use flag 3 covering lock registers 96 - 127.If no lock registers are implemented in this range, then this flag always reads as 0Read 0 : All lock registers 96 - 127 are in the Not Taken stateRead 1 : At least one of the lock registers 96 - 127 are in the Taken state" range="3" rwaccess="RO"/> 
		<bitfield id="IU2" width="1" begin="2" end="2" resetval="0x0" description="In-Use flag 2 covering lock registers 64 - 95.If no lock registers are implemented in this range, then this flag always reads as 0Read 0 : All lock registers 64 - 95 are in the Not Taken stateRead 1 : At least one of the lock registers 64 - 95 are in the Taken state" range="2" rwaccess="RO"/> 
		<bitfield id="IU1" width="1" begin="1" end="1" resetval="0x0" description="In-Use flag 1 covering lock registers 32 - 63.If no lock registers are implemented in this range, then this flag always reads as 0Read 0 : All lock registers 32 - 63 are in the Not Taken stateRead 1 : At least one of the lock registers 32 - 63 are in the Taken state" range="1" rwaccess="RO"/> 
		<bitfield id="IU0" width="1" begin="0" end="0" resetval="0x0" description="In-Use flag 0 covering lock registers 0 - 31.If no lock registers are implemented in this range, then this flag always reads as 0Read 0 : All lock registers 0 - 31 are in the Not Taken stateRead 1 : At least one of the lock registers 0 - 31 are in the Taken state" range="0" rwaccess="RO"/>
	</register>
	<register id="SPINLOCK0_LOCK_REG" acronym="SPINLOCK0_LOCK_REG" offset="0x800" width="0" description="">
		<bitfield id="TAKEN" width="1" begin="0" end="0" resetval="0x0" description="Lock StatusRead 0 : Lock was previously free. The reader now has been granted the lock.Read 1 : Lock was previously taken. The reader has not been granted the lock and must retry.Write 0 : Free the lock by setting TAKEN to zero.Write 1 : No effect" range="0" rwaccess="RW"/>
	</register>
</module>